# OriginalLineweight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLineweightKey..::..OriginalLineweight Property
ExportLineweightKey Class See Also
---
The original line weight.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int OriginalLineweight { get; set; }
```

Visual Basic
---
```text
Public Property OriginalLineweight As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int OriginalLineweight {
	int get ();
	void set (int value);
}
```

# See Also
ExportLineweightKey Class
Autodesk.Revit.DB Namespace